KiwiMusic/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "g"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:user][:email])