KiwiMusic/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "IWBe4jNG1PfqZs0HRGDFqA"], ["id", 2]]
INSERT INTO "users" ("email", "session_token") VALUES ($1, $2) RETURNING "id"  [["email", "d"], ["session_token", "TzwH6A9NQLIFtQtJzPOABg"]]